-- Вставки данных для таблицы clients
INSERT INTO clients (name, passport, phone)
VALUES
    ('Смирнова Ольга Сергеевна', '4512 111222', '+79101112233'),
    ('Кузнецов Дмитрий Петрович', '4513 333444', '+79213334455'),
    ('Морозова Екатерина Александровна', '4514 555666', '+79315556677'),
    ('Васильева Анна Ивановна', '4515 777888', '+79417778899'),
    ('Козлов Алексей Сергеевич', '4516 999000', '+79519990011'),
    ('Новикова Людмила Павловна', '4517 111222', '+79621112233'),
    ('Морозов Павел Александрович', '4518 333444', '+79733334455'),
    ('Кузнецова Ольга Петровна', '4519 555666', '+79845556677'),
    ('Иванова Елена Владимировна', '4520 777888', '+79957778899'),
    ('Петрова Евгения Андреевна', '4521 999000', '+79169990011'),
    ('Смирнов Сергей Павлович', '4522 111222', '+79271112233'),
    ('Козлов Иван Дмитриевич', '4523 333444', '+79383334455'),
    ('Новиков Петр Александрович', '4524 555666', '+79495556677'),
    ('Морозов Владимир Петрович', '4525 777888', '+79607778899'),
    ('Васильев Павел Владимирович', '4526 999000', '+79729990011'),
    ('Смирнова Елена Сергеевна', '4527 111222', '+79831112233');


-- Вставки данных для таблицы areas
INSERT INTO areas (name)
VALUES
    ('Бассейн'),
    ('Кардиозона'),
    ('Зал силовых тренировок');

-- Вставки данных для таблицы trainers
INSERT INTO trainers (name, passport, phone, address)
VALUES
    ('Тренеров Алексей Иванович', '4512 456789', '+79456789012', 'г. Москва, ул. Тренерская, д. 1'),
    ('Петрова Ольга Петровна', '4513 987654', '+79567890123', 'г. Санкт-Петербург, ул. Тренеровая, д. 2'),
    ('Сидоров Степан Сидорович', '4514 135790', '+79678901234', 'г. Екатеринбург, ул. Тренеровская, д. 3');

-- Вставки данных для таблицы activities
INSERT INTO activities (name, trainer_id, area_id)
VALUES
    ('Плавание', 1, 1),
    ('Кардио на беговой дорожке', 2, 2),
    ('Тяга гантелей', 3, 3);

-- Вставки данных для таблицы user_table
INSERT INTO user_table (login, password)
VALUES
    ('user1', 'password1'),
    ('user2', 'password2'),
    ('user3', 'password3');

-- Вставки данных в таблицу subscriptions
INSERT INTO public.subscriprions (client_id, activity_id, date, price)
VALUES
    (1, 1, '2024-04-07', '5000'),
    (2, 2, '2024-04-08', '6000'),
    (3, 3, '2024-04-09', '7000'),
    (4, 1, '2024-04-10', '5500'),
    (6, 3, '2024-04-12', '7500'),
    (7, 1, '2024-04-13', '5200'),
    (8, 2, '2024-04-14', '6200'),
    (9, 3, '2024-04-15', '7200'),
    (10, 1, '2024-04-16', '5300'),
    (11, 2, '2024-04-17', '6300'),
    (12, 3, '2024-04-18', '7300'),
    (13, 1, '2024-04-19', '5400'),
    (14, 2, '2024-04-20', '6400'),
    (15, 3, '2024-04-21', '7400');
